In [2]:
a=5
print (a)

5

In [ ]:
import pandas as pd

In [9]:
pd.read_excel(r"C:\Users\DELL\Documents\Book23.xlsx")

     Name  Salary  Id No
0  vishal   85000     12
1  shakir   12540    521
2   akram   85000     24
3  aaftab   24000     36

In [11]:
pd.read_excel(r"C:\Users\DELL\Documents\Book2.xlsx")

     NAME  SALARY  ID NO
0  VISHAL   85000    452
1  SHAKIR    2500    458
2   AKRAM   25000    654
3  AAFTAB    5240    362

In [12]:
pd.read_csv(r"C:\Users\DELL\Documents\Book23.csv")

     Name  Salary  Id No
0  vishal   85000     12
1  shakir   12540    521
2   akram   85000     24
3  aaftab   24000     36

In [13]:
a=5
b=6
c=a+b
print(c)

11

In [19]:
a=10
print(a)

10

In [20]:
print(type(a))

<class 'int'>

In [21]:
b=10.6
print(b)

10.6

In [22]:
print(type(b))

<class 'float'>

In [29]:
a=6
b=7
c=a+b
print(c)

13

In [30]:
print(type(c))

<class 'int'>

In [33]:
pd.read_csv(r"C:\Users\DELL\Documents\Book1.txt")

  Name\tSalary\tId No
0   vishal\t85000\t12
1    akram\t45200\t15
2   furkan\t45870\t64

In [34]:
pd.read_csv(r"C:\Users\DELL\Documents\Book1.csv")

     Name  Salary  Id No
0  vishal   85000     12
1   akram   45200     15
2  furkan   45870     64
3  shakir   45841     67
4    yhas   25410     57
5  hydair   25663     75

In [35]:
pd.read_excel(r"C:\Users\DELL\Documents\Book23.xlsx")

     Name  Salary  Id No
0  vishal   85000     12
1  shakir   12540    521
2   akram   85000     24
3  Furkan   24000     36
4  naseem   25345     58
5    ayan     125     54

In [36]:
pd.read_csv(r"C:\Users\DELL\Documents\Book23.txt")

  Name\tSalary\tId No
0   vishal\t85000\t12
1  shakir\t12540\t521
2    akram\t85000\t24
3   Furkan\t24000\t36
4   naseem\t25345\t58
5       ayan\t125\t54

In [37]:
import os
os.getcwd()

'C:\\Users\\DELL'

In [47]:
import pandas as pd

In [48]:
pd.read_csv(r"C:\Users\DELL\Documents\Book23.txt")

  Name\tSalary\tId No
0   vishal\t85000\t12
1  shakir\t12540\t521
2    akram\t85000\t24
3   Furkan\t24000\t36
4   naseem\t25345\t58
5       ayan\t125\t54

In [59]:
pd.read_csv(r"C:\Users\DELL\Book 12.txt")

  Name salary roll no id no
0       furkan 25013 213 54
1        akram 25410 211 47
2         yasir 2147 123 78
3          shakir 21456 241

In [61]:
pd.read_csv("Book 12.txt",sep="\t")

  Name salary roll no id no
0       furkan 25013 213 54
1        akram 25410 211 47
2         yasir 2147 123 78
3          shakir 21456 241